{
    "dn10": "The three noble aggregates taught, praised and encouraged by the Buddha: Sīla, involving good conduct by body and speech; Samādhi, encompassing sense restraint, recollection-and-awareness, contentment and jhānas; and Paññā, involving being endowed with knowledge-and-vision and various kinds of abilities including comprehension of mind and seeing the Four Noble Truths with right understanding.",
    "mn2": "The realization of the Dhamma is for one who, having developed and understood how to attend to phenomena with yoniso manasikāra, gives up influxes by seeing, restraining, using, bearing, avoiding, dispelling, and developing.",
    "mn16": "A trainee wishing to progress on the path should do away with ten impediments so that their mind may become fertile ground for achieving maturity in the Dhamma. With this foundation, they can develop composure and zeal—the final essential factors for attaining complete liberation and freedom from suffering.",
    "mn18": "The work of overcoming one's defilements does not depend on something outside of their control; no matter the circumstances one who has developed yoniso manasikāra can strive toward equanimity by attending to the besetting perceptions “in light of their origin”; being unmoved by them one has removed the need for indulgence and denial, they have achieved the Middle Way.",
    "mn19": "Fostering the context of danger and harm of unbeneficial thoughts, as well as making efforts to not think along thoughts stemming from an arisen harmful mental state but instead inclining the mind in the opposite direction, is how one can arrive at the “starvation” of hindrances and develop jhāna.",
    "mn22": "The actions the Buddha warned against as obstructive cannot be performed without there being a harmful mental state, the very root of suffering. The view that one can engage in such acts without impeding progress on the path to awakening is a pernicious misconception.",
    "mn24": "The path to Nibbāna progresses through successive stages of purification, each laying the foundation for the next, ultimately leading to the total cessation of assumption.",
    "mn38": "Misconceptions about dependent origination have the potential to entirely derail one's practice. It is not a temporal sequence of causes and effect but a simultaneous interdependence of two phenomena in the present experience. It's about knowing the uncontrollable underlying foundation of the current phenomenon while that phenomenon is there so appropriation in regard to anything within it ceases.",
    "mn39": "There are various stages of training that make one an ascetic according to the Buddha: Cultivating shame and remorse for wrongdoing; purifying one's actions; guarding and restraining the sense faculties; being moderate in eating; being dedicated to vigilance; acting with recollection-and-awareness; giving up the hindrances; and abiding in jhāna.",
    "mn53": "A noble disciple which is a practicing trainee is endowed with various qualities: They are following the training rules and seeing danger in the slightest fault; guarding the sense doors; eating for the right reasons; cleansing their mind of obstructive states; they have faith in the Buddha's awakening; possess a sense of shame and remorse for bad conduct; are learned and recollected about the teachings; striving to give up unbeneficial qualities for beneficial ones; endowed with noble wisdom; and getting the four jhānas at will.",
}
